{"modelTopology":{"class_name":"Model","config":{"name":"sequential_1_model","layers":[{"name":"dense_Dense1_input","class_name":"InputLayer","config":{"batch_input_shape":[null,4],"dtype":"float32","sparse":false,"name":"dense_Dense1_input"},"inbound_nodes":[]},{"name":"dense_Dense1","class_name":"Dense","config":{"units":8,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true,"batch_input_shape":[null,4],"dtype":"float32"},"inbound_nodes":[[["dense_Dense1_input",0,0,{}]]]},{"name":"reshape_Reshape1","class_name":"Reshape","config":{"target_shape":[2,4],"name":"reshape_Reshape1","trainable":true},"inbound_nodes":[[["dense_Dense1",0,0,{}]]]},{"name":"rnn_RNN1","class_name":"RNN","config":{"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"cell":{"class_name":"StackedRNNCells","config":{"cells":[{"class_name":"LSTMCell","config":{"units":128,"activation":"sigmoid","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"name":"lstm_cell_LSTMCell1","trainable":true}}],"name":"stacked_rnn_cells_StackedRNNCells1","trainable":true}},"name":"rnn_RNN1","trainable":true},"inbound_nodes":[[["reshape_Reshape1",0,0,{}]]]},{"name":"dense_Dense2","class_name":"Dense","config":{"units":2,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2","trainable":true},"inbound_nodes":[[["rnn_RNN1",0,0,{}]]]}],"input_layers":[["dense_Dense1_input",0,0]],"output_layers":[["dense_Dense2",0,0]]},"keras_version":"tfjs-layers 2.0.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v2.0.0","convertedBy":null,"weightsManifest":[{"paths":["./supplement-model-rnn-128.weights.bin"],"weights":[{"name":"dense_Dense1/kernel","shape":[4,8],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[8],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_0/kernel","shape":[4,512],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_0/recurrent_kernel","shape":[128,512],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_0/bias","shape":[512],"dtype":"float32"},{"name":"dense_Dense2/kernel","shape":[128,2],"dtype":"float32"},{"name":"dense_Dense2/bias","shape":[2],"dtype":"float32"}]}]}